<?php

namespace Database\Seeders;

use App\Models\Driver;
use App\Models\InsuranceAccountJournal;
use App\Models\Order;
use App\Models\Ride;
use App\Models\Station;
use App\Models\Auto;
use App\Models\Supplier;
use DB;
use Illuminate\Database\Seeder;

class RideSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public $faker;
    public array $station_addresses = ["Київ", "Львів", "Одеса", "Чернівці", "Дніпро", "Івано-Франківськ", "Харків", "Запоріжжя", "Полтава", "Суми", "Миколаїв", "Черкаси", "Кривий Ріг", "Хмельницький", "Житомир"];
    public array $addresses = [
        "Київ, вул. Хрещатик, 1",
        "Львів, вул. Шевченка, 23",
        "Одеса, вул. Дерибасівська, 10",
        "Чернівці, вул. Героїв Майдану, 15",
        "Дніпро, пр. Дмитра Яворницького, 28",
        "Івано-Франківськ, вул. Незалежності, 24",
        "Харків, вул. Сумська, 45",
        "Запоріжжя, пр. Соборний, 12",
        "Полтава, вул. Пушкіна, 17",
        "Суми, вул. Горького, 8",
        "Київ, вул. Лесі Українки, 7",
        "Хмельницький, вул. Проскурівська, 14",
        "Львів, вул. Франка, 5",
        "Черкаси, бульв. Шевченка, 10",
        "Одеса, вул. Рішельєвська, 18",
        "Кривий Ріг, вул. Михайла Грушевського, 22",
        "Дніпро, вул. Леніна, 15",
        "Миколаїв, вул. Радянська, 3",
        "Харків, пр. Гагаріна, 21",
        "Житомир, вул. Михайлівська, 11",
    ];
    public array $distancies = [

        [
            "point_A" => "Львів, вул. Шевченка, 23",
            "point_B" => "Полтава, вул. Пушкіна, 17",
            "distance" => 882709
        ],
        [
            "point_A" => "Львів, вул. Шевченка, 23",
            "point_B" => "Суми, вул. Горького, 8",
            "distance" => 876226
        ],
        [
            "point_A" => "Львів, вул. Шевченка, 23",
            "point_B" => "Київ, вул. Лесі Українки, 7",
            "distance" => 542117
        ],
        [
            "point_A" => "Львів, вул. Шевченка, 23",
            "point_B" => "Хмельницький, вул. Проскурівська, 14",
            "distance" => 250517
        ],
        [
            "point_A" => "Львів, вул. Шевченка, 23",
            "point_B" => "Львів, вул. Франка, 5",
            "distance" => 3445
        ],
        [
            "point_A" => "Львів, вул. Шевченка, 23",
            "point_B" => "Черкаси, бульв. Шевченка, 10",
            "distance" => 735613
        ],
        [
            "point_A" => "Львів, вул. Шевченка, 23",
            "point_B" => "Одеса, вул. Рішельєвська, 18",
            "distance" => 804286
        ],
        [
            "point_A" => "Львів, вул. Шевченка, 23",
            "point_B" => "Кривий Ріг, вул. Михайла Грушевського, 22",
            "distance" => 824867
        ],
        [
            "point_A" => "Львів, вул. Шевченка, 23",
            "point_B" => "Дніпро, вул. Леніна, 15",
            "distance" => 950552
        ],
        [
            "point_A" => "Львів, вул. Шевченка, 23",
            "point_B" => "Миколаїв, вул. Радянська, 3",
            "distance" => 810682
        ],
        [
            "point_A" => "Львів, вул. Шевченка, 23",
            "point_B" => "Харків, пр. Гагаріна, 21",
            "distance" => 1021286
        ],
        [
            "point_A" => "Львів, вул. Шевченка, 23",
            "point_B" => "Житомир, вул. Михайлівська, 11",
            "distance" => 404471
        ],
        [
            "point_A" => "Одеса, вул. Дерибасівська, 10",
            "point_B" => "Чернівці, вул. Героїв Майдану, 15",
            "distance" => 719905
        ],
        [
            "point_A" => "Одеса, вул. Дерибасівська, 10",
            "point_B" => "Дніпро, пр. Дмитра Яворницького, 28",
            "distance" => 456425
        ],
        [
            "point_A" => "Одеса, вул. Дерибасівська, 10",
            "point_B" => "Івано-Франківськ, вул. Незалежності, 24",
            "distance" => 799155
        ],
        [
            "point_A" => "Одеса, вул. Дерибасівська, 10",
            "point_B" => "Харків, вул. Сумська, 45",
            "distance" => 676721
        ],
        [
            "point_A" => "Одеса, вул. Дерибасівська, 10",
            "point_B" => "Запоріжжя, пр. Соборний, 12",
            "distance" => 529063
        ],
        [
            "point_A" => "Одеса, вул. Дерибасівська, 10",
            "point_B" => "Полтава, вул. Пушкіна, 17",
            "distance" => 562201
        ],
        [
            "point_A" => "Одеса, вул. Дерибасівська, 10",
            "point_B" => "Суми, вул. Горького, 8",
            "distance" => 807307
        ],
        [
            "point_A" => "Одеса, вул. Дерибасівська, 10",
            "point_B" => "Київ, вул. Лесі Українки, 7",
            "distance" => 493675
        ],
        [
            "point_A" => "Одеса, вул. Дерибасівська, 10",
            "point_B" => "Хмельницький, вул. Проскурівська, 14",
            "distance" => 555083
        ],
        [
            "point_A" => "Одеса, вул. Дерибасівська, 10",
            "point_B" => "Львів, вул. Франка, 5",
            "distance" => 797790
        ],
        [
            "point_A" => "Одеса, вул. Дерибасівська, 10",
            "point_B" => "Черкаси, бульв. Шевченка, 10",
            "distance" => 448446
        ],
        [
            "point_A" => "Одеса, вул. Дерибасівська, 10",
            "point_B" => "Одеса, вул. Рішельєвська, 18",
            "distance" => 2085
        ],
        [
            "point_A" => "Одеса, вул. Дерибасівська, 10",
            "point_B" => "Кривий Ріг, вул. Михайла Грушевського, 22",
            "distance" => 309571
        ],
        [
            "point_A" => "Одеса, вул. Дерибасівська, 10",
            "point_B" => "Дніпро, вул. Леніна, 15",
            "distance" => 454979
        ],
        [
            "point_A" => "Одеса, вул. Дерибасівська, 10",
            "point_B" => "Миколаїв, вул. Радянська, 3",
            "distance" => 134617
        ],
        [
            "point_A" => "Одеса, вул. Дерибасівська, 10",
            "point_B" => "Харків, пр. Гагаріна, 21",
            "distance" => 676683
        ],
        [
            "point_A" => "Одеса, вул. Дерибасівська, 10",
            "point_B" => "Житомир, вул. Михайлівська, 11",
            "distance" => 504461
        ],
        [
            "point_A" => "Чернівці, вул. Героїв Майдану, 15",
            "point_B" => "Дніпро, пр. Дмитра Яворницького, 28",
            "distance" => 866403
        ],
        [
            "point_A" => "Чернівці, вул. Героїв Майдану, 15",
            "point_B" => "Івано-Франківськ, вул. Незалежності, 24",
            "distance" => 136633
        ],
        [
            "point_A" => "Чернівці, вул. Героїв Майдану, 15",
            "point_B" => "Харків, вул. Сумська, 45",
            "distance" => 1011258
        ],
        [
            "point_A" => "Чернівці, вул. Героїв Майдану, 15",
            "point_B" => "Запоріжжя, пр. Соборний, 12",
            "distance" => 939041
        ],
        [
            "point_A" => "Чернівці, вул. Героїв Майдану, 15",
            "point_B" => "Полтава, вул. Пушкіна, 17",
            "distance" => 872642
        ],
        [
            "point_A" => "Чернівці, вул. Героїв Майдану, 15",
            "point_B" => "Суми, вул. Горького, 8",
            "distance" => 866159
        ],
        [
            "point_A" => "Чернівці, вул. Героїв Майдану, 15",
            "point_B" => "Київ, вул. Лесі Українки, 7",
            "distance" => 532050
        ],
        [
            "point_A" => "Чернівці, вул. Героїв Майдану, 15",
            "point_B" => "Хмельницький, вул. Проскурівська, 14",
            "distance" => 190004
        ],
        [
            "point_A" => "Чернівці, вул. Героїв Майдану, 15",
            "point_B" => "Львів, вул. Франка, 5",
            "distance" => 276224
        ],
        [
            "point_A" => "Чернівці, вул. Героїв Майдану, 15",
            "point_B" => "Черкаси, бульв. Шевченка, 10",
            "distance" => 633993
        ],
        [
            "point_A" => "Чернівці, вул. Героїв Майдану, 15",
            "point_B" => "Одеса, вул. Рішельєвська, 18",
            "distance" => 718691
        ],
        [
            "point_A" => "Чернівці, вул. Героїв Майдану, 15",
            "point_B" => "Кривий Ріг, вул. Михайла Грушевського, 22",
            "distance" => 739273
        ],
        [
            "point_A" => "Чернівці, вул. Героїв Майдану, 15",
            "point_B" => "Дніпро, вул. Леніна, 15",
            "distance" => 864957
        ],
        [
            "point_A" => "Чернівці, вул. Героїв Майдану, 15",
            "point_B" => "Миколаїв, вул. Радянська, 3",
            "distance" => 725087
        ],
        [
            "point_A" => "Чернівці, вул. Героїв Майдану, 15",
            "point_B" => "Харків, пр. Гагаріна, 21",
            "distance" => 1011220
        ],
        [
            "point_A" => "Чернівці, вул. Героїв Майдану, 15",
            "point_B" => "Житомир, вул. Михайлівська, 11",
            "distance" => 391199
        ],
        [
            "point_A" => "Дніпро, пр. Дмитра Яворницького, 28",
            "point_B" => "Івано-Франківськ, вул. Незалежності, 24",
            "distance" => 946706
        ],
        [
            "point_A" => "Дніпро, пр. Дмитра Яворницького, 28",
            "point_B" => "Харків, вул. Сумська, 45",
            "distance" => 219113
        ],
        [
            "point_A" => "Дніпро, пр. Дмитра Яворницького, 28",
            "point_B" => "Запоріжжя, пр. Соборний, 12",
            "distance" => 94353
        ],
        [
            "point_A" => "Дніпро, пр. Дмитра Яворницького, 28",
            "point_B" => "Полтава, вул. Пушкіна, 17",
            "distance" => 196992
        ],
        [
            "point_A" => "Дніпро, пр. Дмитра Яворницького, 28",
            "point_B" => "Суми, вул. Горького, 8",
            "distance" => 376300
        ],
        [
            "point_A" => "Харків, вул. Сумська, 45",
            "point_B" => "Черкаси, бульв. Шевченка, 10",
            "distance" => 396218
        ],
        [
            "point_A" => "Харків, вул. Сумська, 45",
            "point_B" => "Одеса, вул. Рішельєвська, 18",
            "distance" => 675753
        ],
        [
            "point_A" => "Харків, вул. Сумська, 45",
            "point_B" => "Кривий Ріг, вул. Михайла Грушевського, 22",
            "distance" => 367373
        ],
        [
            "point_A" => "Харків, вул. Сумська, 45",
            "point_B" => "Дніпро, вул. Леніна, 15",
            "distance" => 218649
        ],
        [
            "point_A" => "Харків, вул. Сумська, 45",
            "point_B" => "Миколаїв, вул. Радянська, 3",
            "distance" => 543478
        ],
        [
            "point_A" => "Харків, вул. Сумська, 45",
            "point_B" => "Харків, пр. Гагаріна, 21",
            "distance" => 3671
        ],
        [
            "point_A" => "Харків, вул. Сумська, 45",
            "point_B" => "Житомир, вул. Михайлівська, 11",
            "distance" => 632177
        ],
        [
            "point_A" => "Запоріжжя, пр. Соборний, 12",
            "point_B" => "Полтава, вул. Пушкіна, 17",
            "distance" => 275540
        ],
        [
            "point_A" => "Запоріжжя, пр. Соборний, 12",
            "point_B" => "Суми, вул. Горького, 8",
            "distance" => 454848
        ],
        [
            "point_A" => "Запоріжжя, пр. Соборний, 12",
            "point_B" => "Київ, вул. Лесі Українки, 7",
            "distance" => 573106
        ],
        [
            "point_A" => "Запоріжжя, пр. Соборний, 12",
            "point_B" => "Хмельницький, вул. Проскурівська, 14",
            "distance" => 769620
        ],
        [
            "point_A" => "Запоріжжя, пр. Соборний, 12",
            "point_B" => "Львів, вул. Франка, 5",
            "distance" => 1012327
        ],
        [
            "point_A" => "Запоріжжя, пр. Соборний, 12",
            "point_B" => "Черкаси, бульв. Шевченка, 10",
            "distance" => 390712
        ],
        [
            "point_A" => "Запоріжжя, пр. Соборний, 12",
            "point_B" => "Одеса, вул. Рішельєвська, 18",
            "distance" => 522740
        ],
        [
            "point_A" => "Запоріжжя, пр. Соборний, 12",
            "point_B" => "Кривий Ріг, вул. Михайла Грушевського, 22",
            "distance" => 214360
        ],
        [
            "point_A" => "Запоріжжя, пр. Соборний, 12",
            "point_B" => "Дніпро, вул. Леніна, 15",
            "distance" => 90495
        ],
        [
            "point_A" => "Запоріжжя, пр. Соборний, 12",
            "point_B" => "Миколаїв, вул. Радянська, 3",
            "distance" => 390464
        ],
        [
            "point_A" => "Запоріжжя, пр. Соборний, 12",
            "point_B" => "Харків, пр. Гагаріна, 21",
            "distance" => 297622
        ],
        [
            "point_A" => "Запоріжжя, пр. Соборний, 12",
            "point_B" => "Житомир, вул. Михайлівська, 11",
            "distance" => 695527
        ],
        [
            "point_A" => "Полтава, вул. Пушкіна, 17",
            "point_B" => "Суми, вул. Горького, 8",
            "distance" => 177885
        ],
        [
            "point_A" => "Полтава, вул. Пушкіна, 17",
            "point_B" => "Київ, вул. Лесі Українки, 7",
            "distance" => 362082
        ],
        [
            "point_A" => "Полтава, вул. Пушкіна, 17",
            "point_B" => "Хмельницький, вул. Проскурівська, 14",
            "distance" => 684208
        ],
        [
            "point_A" => "Полтава, вул. Пушкіна, 17",
            "point_B" => "Львів, вул. Франка, 5",
            "distance" => 892835
        ],
        [
            "point_A" => "Полтава, вул. Пушкіна, 17",
            "point_B" => "Черкаси, бульв. Шевченка, 10",
            "distance" => 257991
        ],
        [
            "point_A" => "Полтава, вул. Пушкіна, 17",
            "point_B" => "Одеса, вул. Рішельєвська, 18",
            "distance" => 560286
        ],
        [
            "point_A" => "Полтава, вул. Пушкіна, 17",
            "point_B" => "Кривий Ріг, вул. Михайла Грушевського, 22",
            "distance" => 283202
        ],
        [
            "point_A" => "Полтава, вул. Пушкіна, 17",
            "point_B" => "Дніпро, вул. Леніна, 15",
            "distance" => 198466
        ],
        [
            "point_A" => "Полтава, вул. Пушкіна, 17",
            "point_B" => "Миколаїв, вул. Радянська, 3",
            "distance" => 428582
        ],
        [
            "point_A" => "Полтава, вул. Пушкіна, 17",
            "point_B" => "Харків, пр. Гагаріна, 21",
            "distance" => 143248
        ],
        [
            "point_A" => "Полтава, вул. Пушкіна, 17",
            "point_B" => "Житомир, вул. Михайлівська, 11",
            "distance" => 493950
        ],
        [
            "point_A" => "Суми, вул. Горького, 8",
            "point_B" => "Київ, вул. Лесі Українки, 7",
            "distance" => 344402
        ],
        [
            "point_A" => "Суми, вул. Горького, 8",
            "point_B" => "Хмельницький, вул. Проскурівська, 14",
            "distance" => 666528
        ],
        [
            "point_A" => "Суми, вул. Горького, 8",
            "point_B" => "Львів, вул. Франка, 5",
            "distance" => 875155
        ],
        [
            "point_A" => "Суми, вул. Горького, 8",
            "point_B" => "Черкаси, бульв. Шевченка, 10",
            "distance" => 324887
        ],
        [
            "point_A" => "Суми, вул. Горького, 8",
            "point_B" => "Одеса, вул. Рішельєвська, 18",
            "distance" => 805149
        ],
        [
            "point_A" => "Суми, вул. Горького, 8",
            "point_B" => "Кривий Ріг, вул. Михайла Грушевського, 22",
            "distance" => 526022
        ],
        [
            "point_A" => "Суми, вул. Горького, 8",
            "point_B" => "Дніпро, вул. Леніна, 15",
            "distance" => 377298
        ],
        [
            "point_A" => "Суми, вул. Горького, 8",
            "point_B" => "Миколаїв, вул. Радянська, 3",
            "distance" => 607921
        ],
        [
            "point_A" => "Суми, вул. Горького, 8",
            "point_B" => "Харків, пр. Гагаріна, 21",
            "distance" => 189263
        ],
        [
            "point_A" => "Суми, вул. Горького, 8",
            "point_B" => "Житомир, вул. Михайлівська, 11",
            "distance" => 476270
        ],
        [
            "point_A" => "Київ, вул. Лесі Українки, 7",
            "point_B" => "Хмельницький, вул. Проскурівська, 14",
            "distance" => 333588
        ],
        [
            "point_A" => "Київ, вул. Лесі Українки, 7",
            "point_B" => "Львів, вул. Франка, 5",
            "distance" => 542215
        ],
        [
            "point_A" => "Київ, вул. Лесі Українки, 7",
            "point_B" => "Черкаси, бульв. Шевченка, 10",
            "distance" => 199497
        ],
        [
            "point_A" => "Київ, вул. Лесі Українки, 7",
            "point_B" => "Одеса, вул. Рішельєвська, 18",
            "distance" => 492059
        ],
        [
            "point_A" => "Київ, вул. Лесі Українки, 7",
            "point_B" => "Кривий Ріг, вул. Михайла Грушевського, 22",
            "distance" => 427058
        ],
        [
            "point_A" => "Київ, вул. Лесі Українки, 7",
            "point_B" => "Дніпро, вул. Леніна, 15",
            "distance" => 497720
        ],
        [
            "point_A" => "Київ, вул. Лесі Українки, 7",
            "point_B" => "Миколаїв, вул. Радянська, 3",
            "distance" => 497114
        ],
        [
            "point_A" => "Київ, вул. Лесі Українки, 7",
            "point_B" => "Харків, пр. Гагаріна, 21",
            "distance" => 498704
        ],
        [
            "point_A" => "Київ, вул. Лесі Українки, 7",
            "point_B" => "Житомир, вул. Михайлівська, 11",
            "distance" => 143330
        ],
        [
            "point_A" => "Хмельницький, вул. Проскурівська, 14",
            "point_B" => "Львів, вул. Франка, 5",
            "distance" => 239918
        ],
        [
            "point_A" => "Київ, вул. Хрещатик, 1",
            "point_B" => "Львів, вул. Шевченка, 23",
            "distance" => 541278
        ],
        [
            "point_A" => "Київ, вул. Хрещатик, 1",
            "point_B" => "Одеса, вул. Дерибасівська, 10",
            "distance" => 476318
        ],
        [
            "point_A" => "Київ, вул. Хрещатик, 1",
            "point_B" => "Чернівці, вул. Героїв Майдану, 15",
            "distance" => 525587
        ],
        [
            "point_A" => "Київ, вул. Хрещатик, 1",
            "point_B" => "Дніпро, пр. Дмитра Яворницького, 28",
            "distance" => 478364
        ],
        [
            "point_A" => "Київ, вул. Хрещатик, 1",
            "point_B" => "Івано-Франківськ, вул. Незалежності, 24",
            "distance" => 604607
        ],
        [
            "point_A" => "Київ, вул. Хрещатик, 1",
            "point_B" => "Харків, вул. Сумська, 45",
            "distance" => 481758
        ],
        [
            "point_A" => "Київ, вул. Хрещатик, 1",
            "point_B" => "Запоріжжя, пр. Соборний, 12",
            "distance" => 566853
        ],
        [
            "point_A" => "Київ, вул. Хрещатик, 1",
            "point_B" => "Полтава, вул. Пушкіна, 17",
            "distance" => 343141
        ],
        [
            "point_A" => "Київ, вул. Хрещатик, 1",
            "point_B" => "Суми, вул. Горького, 8",
            "distance" => 336519
        ],
        [
            "point_A" => "Київ, вул. Хрещатик, 1",
            "point_B" => "Київ, вул. Лесі Українки, 7",
            "distance" => 11919
        ],
        [
            "point_A" => "Київ, вул. Хрещатик, 1",
            "point_B" => "Хмельницький, вул. Проскурівська, 14",
            "distance" => 330930
        ],
        [
            "point_A" => "Київ, вул. Хрещатик, 1",
            "point_B" => "Львів, вул. Франка, 5",
            "distance" => 539557
        ],
        [
            "point_A" => "Київ, вул. Хрещатик, 1",
            "point_B" => "Черкаси, бульв. Шевченка, 10",
            "distance" => 190278
        ],
        [
            "point_A" => "Київ, вул. Хрещатик, 1",
            "point_B" => "Одеса, вул. Рішельєвська, 18",
            "distance" => 475880
        ],
        [
            "point_A" => "Київ, вул. Хрещатик, 1",
            "point_B" => "Кривий Ріг, вул. Михайла Грушевського, 22",
            "distance" => 418018
        ],
        [
            "point_A" => "Київ, вул. Хрещатик, 1",
            "point_B" => "Дніпро, вул. Леніна, 15",
            "distance" => 480736
        ],
        [
            "point_A" => "Київ, вул. Хрещатик, 1",
            "point_B" => "Миколаїв, вул. Радянська, 3",
            "distance" => 488074
        ],
        [
            "point_A" => "Київ, вул. Хрещатик, 1",
            "point_B" => "Харків, пр. Гагаріна, 21",
            "distance" => 481719
        ],
        [
            "point_A" => "Київ, вул. Хрещатик, 1",
            "point_B" => "Житомир, вул. Михайлівська, 11",
            "distance" => 140672
        ],
        [
            "point_A" => "Львів, вул. Шевченка, 23",
            "point_B" => "Одеса, вул. Дерибасівська, 10",
            "distance" => 804724
        ],
        [
            "point_A" => "Львів, вул. Шевченка, 23",
            "point_B" => "Чернівці, вул. Героїв Майдану, 15",
            "distance" => 279843
        ],
        [
            "point_A" => "Львів, вул. Шевченка, 23",
            "point_B" => "Дніпро, пр. Дмитра Яворницького, 28",
            "distance" => 951997
        ],
        [
            "point_A" => "Львів, вул. Шевченка, 23",
            "point_B" => "Івано-Франківськ, вул. Незалежності, 24",
            "distance" => 136280
        ],
        [
            "point_A" => "Львів, вул. Шевченка, 23",
            "point_B" => "Харків, вул. Сумська, 45",
            "distance" => 1021325
        ],
        [
            "point_A" => "Львів, вул. Шевченка, 23",
            "point_B" => "Запоріжжя, пр. Соборний, 12",
            "distance" => 1024636
        ],
        [
            "point_A" => "Дніпро, пр. Дмитра Яворницького, 28",
            "point_B" => "Київ, вул. Лесі Українки, 7",
            "distance" => 496009
        ],
        [
            "point_A" => "Дніпро, пр. Дмитра Яворницького, 28",
            "point_B" => "Хмельницький, вул. Проскурівська, 14",
            "distance" => 702634
        ],
        [
            "point_A" => "Дніпро, пр. Дмитра Яворницького, 28",
            "point_B" => "Львів, вул. Франка, 5",
            "distance" => 945341
        ],
        [
            "point_A" => "Дніпро, пр. Дмитра Яворницького, 28",
            "point_B" => "Черкаси, бульв. Шевченка, 10",
            "distance" => 323725
        ],
        [
            "point_A" => "Дніпро, пр. Дмитра Яворницького, 28",
            "point_B" => "Одеса, вул. Рішельєвська, 18",
            "distance" => 455754
        ],
        [
            "point_A" => "Дніпро, пр. Дмитра Яворницького, 28",
            "point_B" => "Кривий Ріг, вул. Михайла Грушевського, 22",
            "distance" => 147374
        ],
        [
            "point_A" => "Дніпро, пр. Дмитра Яворницького, 28",
            "point_B" => "Дніпро, вул. Леніна, 15",
            "distance" => 2191
        ],
        [
            "point_A" => "Дніпро, пр. Дмитра Яворницького, 28",
            "point_B" => "Миколаїв, вул. Радянська, 3",
            "distance" => 323478
        ],
        [
            "point_A" => "Дніпро, пр. Дмитра Яворницького, 28",
            "point_B" => "Харків, пр. Гагаріна, 21",
            "distance" => 219074
        ],
        [
            "point_A" => "Дніпро, пр. Дмитра Яворницького, 28",
            "point_B" => "Житомир, вул. Михайлівська, 11",
            "distance" => 628541
        ],
        [
            "point_A" => "Івано-Франківськ, вул. Незалежності, 24",
            "point_B" => "Харків, вул. Сумська, 45",
            "distance" => 1084880
        ],
        [
            "point_A" => "Івано-Франківськ, вул. Незалежності, 24",
            "point_B" => "Запоріжжя, пр. Соборний, 12",
            "distance" => 1018539
        ],
        [
            "point_A" => "Івано-Франківськ, вул. Незалежності, 24",
            "point_B" => "Полтава, вул. Пушкіна, 17",
            "distance" => 946264
        ],
        [
            "point_A" => "Івано-Франківськ, вул. Незалежності, 24",
            "point_B" => "Суми, вул. Горького, 8",
            "distance" => 939782
        ],
        [
            "point_A" => "Івано-Франківськ, вул. Незалежності, 24",
            "point_B" => "Київ, вул. Лесі Українки, 7",
            "distance" => 605672
        ],
        [
            "point_A" => "Івано-Франківськ, вул. Незалежності, 24",
            "point_B" => "Хмельницький, вул. Проскурівська, 14",
            "distance" => 244421
        ],
        [
            "point_A" => "Івано-Франківськ, вул. Незалежності, 24",
            "point_B" => "Львів, вул. Франка, 5",
            "distance" => 132298
        ],
        [
            "point_A" => "Івано-Франківськ, вул. Незалежності, 24",
            "point_B" => "Черкаси, бульв. Шевченка, 10",
            "distance" => 713491
        ],
        [
            "point_A" => "Івано-Франківськ, вул. Незалежності, 24",
            "point_B" => "Одеса, вул. Рішельєвська, 18",
            "distance" => 798189
        ],
        [
            "point_A" => "Івано-Франківськ, вул. Незалежності, 24",
            "point_B" => "Кривий Ріг, вул. Михайла Грушевського, 22",
            "distance" => 818771
        ],
        [
            "point_A" => "Івано-Франківськ, вул. Незалежності, 24",
            "point_B" => "Дніпро, вул. Леніна, 15",
            "distance" => 944455
        ],
        [
            "point_A" => "Івано-Франківськ, вул. Незалежності, 24",
            "point_B" => "Миколаїв, вул. Радянська, 3",
            "distance" => 804585
        ],
        [
            "point_A" => "Івано-Франківськ, вул. Незалежності, 24",
            "point_B" => "Харків, пр. Гагаріна, 21",
            "distance" => 1084842
        ],
        [
            "point_A" => "Івано-Франківськ, вул. Незалежності, 24",
            "point_B" => "Житомир, вул. Михайлівська, 11",
            "distance" => 418350
        ],
        [
            "point_A" => "Харків, вул. Сумська, 45",
            "point_B" => "Запоріжжя, пр. Соборний, 12",
            "distance" => 299507
        ],
        [
            "point_A" => "Харків, вул. Сумська, 45",
            "point_B" => "Полтава, вул. Пушкіна, 17",
            "distance" => 143897
        ],
        [
            "point_A" => "Харків, вул. Сумська, 45",
            "point_B" => "Суми, вул. Горького, 8",
            "distance" => 189413
        ],
        [
            "point_A" => "Харків, вул. Сумська, 45",
            "point_B" => "Київ, вул. Лесі Українки, 7",
            "distance" => 500308
        ],
        [
            "point_A" => "Харків, вул. Сумська, 45",
            "point_B" => "Хмельницький, вул. Проскурівська, 14",
            "distance" => 822435
        ],
        [
            "point_A" => "Харків, вул. Сумська, 45",
            "point_B" => "Львів, вул. Франка, 5",
            "distance" => 1031062
        ],
        [
            "point_A" => "Хмельницький, вул. Проскурівська, 14",
            "point_B" => "Черкаси, бульв. Шевченка, 10",
            "distance" => 469056
        ],
        [
            "point_A" => "Хмельницький, вул. Проскурівська, 14",
            "point_B" => "Одеса, вул. Рішельєвська, 18",
            "distance" => 553754
        ],
        [
            "point_A" => "Хмельницький, вул. Проскурівська, 14",
            "point_B" => "Кривий Ріг, вул. Михайла Грушевського, 22",
            "distance" => 574336
        ],
        [
            "point_A" => "Хмельницький, вул. Проскурівська, 14",
            "point_B" => "Дніпро, вул. Леніна, 15",
            "distance" => 700020
        ],
        [
            "point_A" => "Хмельницький, вул. Проскурівська, 14",
            "point_B" => "Миколаїв, вул. Радянська, 3",
            "distance" => 560150
        ],
        [
            "point_A" => "Хмельницький, вул. Проскурівська, 14",
            "point_B" => "Харків, пр. Гагаріна, 21",
            "distance" => 810908
        ],
        [
            "point_A" => "Хмельницький, вул. Проскурівська, 14",
            "point_B" => "Житомир, вул. Михайлівська, 11",
            "distance" => 193370
        ],
        [
            "point_A" => "Львів, вул. Франка, 5",
            "point_B" => "Черкаси, бульв. Шевченка, 10",
            "distance" => 711802
        ],
        [
            "point_A" => "Львів, вул. Франка, 5",
            "point_B" => "Одеса, вул. Рішельєвська, 18",
            "distance" => 796501
        ],
        [
            "point_A" => "Львів, вул. Франка, 5",
            "point_B" => "Кривий Ріг, вул. Михайла Грушевського, 22",
            "distance" => 817082
        ],
        [
            "point_A" => "Львів, вул. Франка, 5",
            "point_B" => "Дніпро, вул. Леніна, 15",
            "distance" => 942767
        ],
        [
            "point_A" => "Львів, вул. Франка, 5",
            "point_B" => "Миколаїв, вул. Радянська, 3",
            "distance" => 802897
        ],
        [
            "point_A" => "Львів, вул. Франка, 5",
            "point_B" => "Харків, пр. Гагаріна, 21",
            "distance" => 1020498
        ],
        [
            "point_A" => "Львів, вул. Франка, 5",
            "point_B" => "Житомир, вул. Михайлівська, 11",
            "distance" => 403683
        ],
        [
            "point_A" => "Черкаси, бульв. Шевченка, 10",
            "point_B" => "Одеса, вул. Рішельєвська, 18",
            "distance" => 446199
        ],
        [
            "point_A" => "Черкаси, бульв. Шевченка, 10",
            "point_B" => "Кривий Ріг, вул. Михайла Грушевського, 22",
            "distance" => 247063
        ],
        [
            "point_A" => "Черкаси, бульв. Шевченка, 10",
            "point_B" => "Дніпро, вул. Леніна, 15",
            "distance" => 321427
        ],
        [
            "point_A" => "Черкаси, бульв. Шевченка, 10",
            "point_B" => "Миколаїв, вул. Радянська, 3",
            "distance" => 317119
        ],
        [
            "point_A" => "Черкаси, бульв. Шевченка, 10",
            "point_B" => "Харків, пр. Гагаріна, 21",
            "distance" => 381535
        ],
        [
            "point_A" => "Черкаси, бульв. Шевченка, 10",
            "point_B" => "Житомир, вул. Михайлівська, 11",
            "distance" => 330907
        ],
        [
            "point_A" => "Одеса, вул. Рішельєвська, 18",
            "point_B" => "Кривий Ріг, вул. Михайла Грушевського, 22",
            "distance" => 308892
        ],
        [
            "point_A" => "Одеса, вул. Рішельєвська, 18",
            "point_B" => "Дніпро, вул. Леніна, 15",
            "distance" => 454299
        ],
        [
            "point_A" => "Одеса, вул. Рішельєвська, 18",
            "point_B" => "Миколаїв, вул. Радянська, 3",
            "distance" => 133937
        ],
        [
            "point_A" => "Одеса, вул. Рішельєвська, 18",
            "point_B" => "Харків, пр. Гагаріна, 21",
            "distance" => 676003
        ],
        [
            "point_A" => "Одеса, вул. Рішельєвська, 18",
            "point_B" => "Житомир, вул. Михайлівська, 11",
            "distance" => 502985
        ],
        [
            "point_A" => "Кривий Ріг, вул. Михайла Грушевського, 22",
            "point_B" => "Дніпро, вул. Леніна, 15",
            "distance" => 145363
        ],
        [
            "point_A" => "Кривий Ріг, вул. Михайла Грушевського, 22",
            "point_B" => "Миколаїв, вул. Радянська, 3",
            "distance" => 176285
        ],
        [
            "point_A" => "Кривий Ріг, вул. Михайла Грушевського, 22",
            "point_B" => "Харків, пр. Гагаріна, 21",
            "distance" => 367067
        ],
        [
            "point_A" => "Кривий Ріг, вул. Михайла Грушевського, 22",
            "point_B" => "Житомир, вул. Михайлівська, 11",
            "distance" => 523880
        ],
        [
            "point_A" => "Дніпро, вул. Леніна, 15",
            "point_B" => "Миколаїв, вул. Радянська, 3",
            "distance" => 321289
        ],
        [
            "point_A" => "Дніпро, вул. Леніна, 15",
            "point_B" => "Харків, пр. Гагаріна, 21",
            "distance" => 219349
        ],
        [
            "point_A" => "Дніпро, вул. Леніна, 15",
            "point_B" => "Житомир, вул. Михайлівська, 11",
            "distance" => 626352
        ],
        [
            "point_A" => "Миколаїв, вул. Радянська, 3",
            "point_B" => "Харків, пр. Гагаріна, 21",
            "distance" => 542214
        ],
        [
            "point_A" => "Миколаїв, вул. Радянська, 3",
            "point_B" => "Житомир, вул. Михайлівська, 11",
            "distance" => 509415
        ],
        [
            "point_A" => "Харків, пр. Гагаріна, 21",
            "point_B" => "Житомир, вул. Михайлівська, 11",
            "distance" => 632626
        ]
    ];
    public array $auto_types = ['Цистерна', 'Рефрежиратор', 'Контейнер'];
    public array $products = [
        "Будівельна цегла",
        "Цемент в мішках",
        "Металеві труби",
        "Побутова техніка",
        "Дерев'яні дошки",
        "Автомобільні шини",
        "Пластикові вікна",
        "Овочі (картопля, морква)",
        "Молочна продукція",
        "Заморожене м'ясо",
        "Побутова хімія",
        "Меблі (шафа, ліжко)",
        "Електроінструменти",
        "Одяг та взуття",
        "Комп'ютерна техніка",
        "Канцелярські товари",
        "Лакофарбова продукція",
        "Паливні брикети",
        "Запасні частини до авто",
        "Господарські товари",
        "Будівельна плитка",
        "Керамічний посуд",
        "Газоблоки",
        "Шпалери",
        "Сантехнічне обладнання",
        "Фрукти (яблука, апельсини)",
        "Алкогольні напої",
        "Текстиль (покривала, штори)",
        "Скляні вироби",
        "Двері міжкімнатні"
    ];
    public function run(): void
    {
        $this->faker = \Faker\Factory::create();
        Order::truncate();
        Ride::truncate();
        $last_date = strtotime(date('Y-m-d'));
        $current_date = strtotime(date('Y-m-01', strtotime('-6 months', $last_date)));
        while ($current_date < $last_date) {
            if ($this->isStartOfMonth($current_date)) {
                $this->SuppliersMakesOrders($current_date);
                $this->CancelOrders();//for supplier
                $this->CancelOrders();//for manadgers
            }
            // if ($this->isStartOfWeek($current_date)) {
                // $this->HideDrivers();
                // $this->MenedgersMakesRides($current_date);
                // $this->OpenDrivers();
            // }
            // if($this->isEndOfWeek($current_date)){
            //     foreach(Ride::where('status','') as $ride)
            //     {
            //         Ride::find($ride->id)->update([
            //             'status'=>'Виконано'
            //         ]);
            //         foreach ($ride->orders as $order) {
            //             Order::find($order->id)->update([
            //                 'status'=>'Доставлено'
            //             ]);
            //         }
            //         Driver::find($ride->driver_id)->update([
            //             'status'=>'Відпочиває'
            //         ]);

            //     }
            // }
            $current_date = strtotime('+1 day', $current_date);
        }
    }
    private function SuppliersMakesOrders($current_date)
    {
        foreach (Supplier::all() as $supplier) {
            $number_of_orders = rand(1, 3);
            for ($i = 0; $i < $number_of_orders; $i++) {
                $point_A = $this->RandAddress();
                $point_B = $this->RandAddress();
                $distance = $this->FindDistance($point_A, $point_B);
                $distanceM=round($distance/1000);
                $weigth = rand(500, 4000);

                $nazinka_w = 0.0001 * $weigth + 1;
                $nazinka = 1.50;

                $vutratu =$distanceM*5.1;
                if($weigth<=2000){
                    $vutratu +=$distanceM*3.1+$distanceM*10;
                }else{
                    $vutratu +=$distanceM*4+$distanceM*12;
                }


                $vutratu = round($vutratu);
                Order::create([
                    'product' => $this->RandProduct(),
                    'auto_type' => $this->auto_types[rand(0, 2)],
                    'weigth' => $weigth,
                    'supplier_id' => $supplier->id,
                    'status' => 'Створено',
                    'date_of_start' => date('Y-m', $current_date) . '-' . rand(1, 28),
                    'point_A' => $point_A,
                    'point_B' => $point_B,
                    'distance' => $distance,
                    'vutratu' => $vutratu,
                ]);
                $this->InsuranceAccountJournalUpdate($vutratu, $supplier->user_id);
            }
        }

    }
    private int $old_sum=0;
    private function InsuranceAccountJournalUpdate($vutratu, $supplier_id)
    {
        $this->old_sum += $vutratu * 0.05;
        InsuranceAccountJournal::create([
            "current_sum" => $this->old_sum,
            "user_id" => $supplier_id,
        ]);
    }
    private function RandAddress()
    {
        return $this->addresses[rand(0, count($this->addresses) - 1)];
    }
    private function RandProduct()
    {
        return $this->products[rand(0, count($this->products) - 1)];
    }
    private function MenedgersMakesRides($current_date)
    {
        $counter_for_stop_cicle = 0;
        while ($counter_for_stop_cicle < 15 && $this->HaveNotChoosedOrders()) {
            foreach (Station::all() as $station) {
                if (!$this->CheckStationCanTakeOrders($station->id,$current_date)) {
                    $counter_for_stop_cicle++;
                } else {
                    $drivers = DB::table('drivers')->where('status', 'Працює')->where('current_station', $station->id)->get();
                    $drivers2 = [];
                    foreach ($drivers as $driver) {
                        if (!is_null($driver->auto))
                            $drivers2[] = $driver;
                    }

                    if (count($drivers2) != 0) {
                        $driver = $drivers2[0];
                        $number_of_orders = $driver->auto->type != 'Цистерна' ? rand(2, 5) : 1;
                        $filtered_orders = DB::table('orders')->where('status', 'Створено')->where('auto_type', $driver->auto->type)->whereBetween('date_of_start', $this->StartAndEndOfWeek($current_date, true))->get();
                        $ride = [
                            'orders_ids' => [],
                            'points' => [],
                            'weigth' => 0,
                            'weigth_left' => 0,
                            'weigth_max' => $driver->auto->lifting_weight,
                            'station_start_id' => $station->id,
                            'station_end_id' => null,
                            'date' => null,
                            'distance' => 0,
                            'vutratu' => 0,
                            'vuruchka' => 0,
                            'driver_zarplata' => 0,
                        ];
                        for ($i = 0; $i < $number_of_orders; $i++) {
                            foreach ($filtered_orders as $order) {
                                if ($order->weigth <= $ride['weigth_left'] && !in_array($order->id, $ride['orders_ids'])) {
                                    array_push($ride['orders_ids'], $order->id);
                                    //change weigths
                                    $ride['weigth'] += $order->weigth;
                                    $ride['weigth_left'] = $ride['weigth_max'] - $ride['weigth'];
                                }
                            }
                        }
                        if (!empty($ride['orders_ids'])) {
                            //find route
                            $this->BuildRoute($ride, $current_date, $station->address);

                            //insert in DB
                            $new_ride = Ride::create([
                                'points' => $ride['points'],
                                'station_start_id' => $ride['station_start_id'],
                                'station_end_id' => $ride['station_end_id'],
                                'driver_id' => $driver->id,
                                'date' => $ride['date'],
                                'distance' => $ride['distance'],
                                'weigth' => $ride['weigth'],
                                'vutratu' => $ride['vutratu'],
                                'vuruchka' => $ride['vuruchka'],
                                'driver_zarplata' => $ride['driver_zarplata'],
                                'status' => 'Створено',
                            ]);
                            //update orders (+ date)
                            foreach ($ride['points'] as $point) {
                                if ($point['type'] == 'Забрати') {
                                    Order::find($point['id'])->update([
                                        'date_of_start' => $point['date'],
                                    ]);
                                }
                                Order::find($point['id'])->update([
                                    'status' => 'Призначено',
                                    'driver_id' => $driver->id,
                                    'ride_id' => $new_ride->id,
                                    'auto_id' => $driver->auto->id,
                                    'station_id' => $station->id
                                ]);
                            }
                        }
                    } else {
                        $counter_for_stop_cicle++;
                    }

                }
            }
        }
    }
    private function BuildRoute(&$ride, $date, $station_address)
    {
        //1.get addressess
        $orders = [];
        $addresses = [];
        foreach ($ride['orders_ids'] as $order_id) {
            $order = Order::find($order_id);
            $orders[] = $order;
            $addresses[] = $order->point_A;
            $addresses[] = $order->point_B;
        }
        //2.get combinations
        $test = new Combination(array: $addresses);
        $combinations = $test->getResult();
        //3.get perfect route
        $routes = [];
        foreach ($combinations as $combination) {
            $route = [
                'points' => [],
                'sum' => 0
            ];
            foreach ($combination as $index => $elem) {
                $date = strtotime('+1 day', $date);
                foreach ($orders as $order) {
                    if ($elem == $order->point_A) {
                        array_push($route['points'], [
                            'index' => $index,
                            'id' => $order->id,
                            'title' => $order->point_A,
                            'product' => $order->product,
                            'type' => 'Забрати',
                            'supplier_name' => $order->supplier->full_name,
                            'supplier_phone' => $order->supplier->phone,
                            'date' => date('Y-m-d', $date),

                        ]);
                    } else if ($elem == $order->point_B) {
                        array_push($route['points'], [
                            'index' => $index,
                            'id' => $order->id,
                            'title' => $order->point_B,
                            'product' => $order->product,
                            'type' => 'Привезти',
                            'supplier_name' => $order->supplier->full_name,
                            'supplier_phone' => $order->supplier->phone,
                            'date' => date('Y-m-d', $date),

                        ]);
                    }
                }
            }

            if ($this->CheckRoute($route['points'])) {
                $route['sum'] += $this->FindDistance($station_address, $route['points'][0]['title']);
                for ($i = 0; $i < count($combination) - 1; $i++) {
                    $route['sum'] += $this->FindDistance($combination[$i], $combination[$i + 1]);
                }
            }

            $routes[] = $route;
        }
        $perfect_route = $routes[0];
        foreach ($routes as $route) {
            if ($route['sum'] < $perfect_route['sum'])
                $perfect_route = $route;
        }
        //4.add perfect station end
        $stations = DB::table('stations')->select('address')->get();
        $perfect_station_end = $stations[0];
        $last_address = end($perfect_route['points']);
        for ($i = 0; $i < count($stations) - 1; $i++) {
            $station_address = $stations[$i]->address;
            if ($this->FindDistance($last_address, $station_address) < $this->FindDistance($last_address, $perfect_station_end->address)) {
                $perfect_station_end = $stations[$i];
            }
        }

        //5.create points array
        $ride['points'] = $perfect_route['points'];
        //6.create date
        $ride['date'] = date('Y-m-d', strtotime('+1 day', $date));
        //7.add distance,vutratu,vuruchka,driver_salary
        $dohid = 0;
        foreach ($orders as $order) {
            $dohid += $order->vutratu;
        }
        $ride['distance'] = $perfect_route['sum'];
        $ride['vutratu'] = $ride['distance'] * 5.1;
        $ride['vuruchka'] = $dohid - $ride['vutratu'];
        $ride['driver_zarplata'] = $ride['vuruchka'] * 0.4;
    }
    private function CheckRoute($points)
    {
        // Якщо маршрут починається з B — невалідний
        if (!empty($points) && $points[0]['type'] == "Привезти")
            return false;

        $pickedProducts = []; // які продукти вже забрали (A)

        for ($i = 0; $i < count($points); $i++) {
            $point = $points[$i];
            if ($point['type'] == "Забрати") {
                $pickedProducts[]=$point['index'];
            } else if ($point['type'] == "Привезти") {
                if (!in_array($point['index'],$pickedProducts)) {
                    return false;
                }
            }
        }

        return true;
    }
    private function FindDistance($point1, $point2)
    {
        if ($point1 == $point2)
            return 0;
        foreach ($this->distancies as $distance) {
            if ($distance['point_A'] == $point1 && $distance['point_B'] == $point2) {
                return $distance['distance'];
            } else if ($distance['point_B'] == $point1 && $distance['point_A'] == $point2) {
                return $distance['distance'];
            }
        }
        return null;
    }
    private function StartAndEndOfWeek($date, $withFormat = false)
    {
        if ($withFormat) {
            return [
                date('Y-m-d', $date),
                date('Y-m-d', strtotime('+7 day', $date)),
            ];
        } else {
            return [
                $date,
                strtotime('+7 day', $date)
            ];
        }
    }
    private function HaveNotChoosedOrders()
    {
        if(Order::where('status','Створено')->exists()) return true;
        else return false;
    }
    private function CheckStationCanTakeOrders($station_id,$current_date)
    {
        //перевірити чи є на станції вільні водії
        $drivers=DB::table('drivers')->where('station_id',$station_id)->where('status','Відпочиває')->get();
        if(empty($drivers)) return false;
        $auto_types=[];
        foreach ($drivers as $driver) {
            if(isset($driver->auto)) {
                if(!in_array($driver->auto->type,$auto_types)){

               $auto_types[]=$driver->auto->type;
                }
            }
        }
        $counter=0;
        foreach ($auto_types as $auto_type) {
            $orders=DB::table('orders')->where('status','Створено')->where('auto_type',$auto_type)->get();
            if(!empty($orders)) $counter++;//check
        }
        if($counter==count($auto_types)) return false;
        else return true;
    }
    private function CancelOrders($chance = 5)
    {
        $orders = DB::table('orders')->where('status', 'Створено')->get();//check
        foreach ($orders as $order) {
            if ($chance > rand(0, 100)) {
                Order::find($order->id)->update([
                    'status' => 'Скасовано'
                ]);
            }
        }
    }
    private function HideDrivers()
    {
        //check
        foreach (Station::all() as $station) {
            $drivers = DB::table('drivers')->where('status', 'Відпочиває')->where('current_station', $station->id)->get();
            $checked_types = [false, false, false];//['Цистерна', 'Рефрежиратор', 'Контейнер']
            foreach ($drivers as $driver) {
                if (!is_null($driver->auto)) {
                    if ($driver->auto->type == 'Цистерна' && $checked_types[0] == false) {
                        $driver->update([
                            'status' => 'В відпусці',
                        ]);
                        $checked_types[0] = true;
                    } else if ($driver->auto->type == 'Рефрежиратор' && $checked_types[1] == false) {
                        $driver->update([
                            'status' => 'В відпусці',
                        ]);
                        $checked_types[1] = true;
                    } else if ($driver->auto->type == 'Контейнер' && $checked_types[2] == false) {
                        $driver->update([
                            'status' => 'В відпусці',
                        ]);
                        $checked_types[2] = true;
                    }
                }
            }
        }
    }
    private function OpenDrivers()
    {
        $drivers = DB::table('drivers')->where('status', 'В відпусці')->get();
        foreach ($drivers as $driver) {
            $driver->update([
                'status' => 'Відпочиває',
            ]);
        }
    }
    private function isStartOfMonth($timestamp)
    {
        return date('d', $timestamp) === '01';
    }

    private function isStartOfWeek($timestamp)
    {
        return date('N', $timestamp) == 1;
    }
    private function isEndOfWeek($timestamp)
    {
        return date('N', $timestamp) == 6;
    }

}

class Combination
{
    private $result;

    //add property
    public function getResult()
    {
        return $this->result;
    }

    function __construct(array $array)
    {
        $this->result = [];

        $this->getCombinations($array, 0, count($array) - 1);
    }
    private function getCombinations($a, $i, $n)
    {
        if ($i == $n) {
            $this->result[] = $a;
        } else {
            for ($j = $i; $j <= $n; $j++) {
                $this->swap($a, $i, $j);
                $this->getCombinations($a, $i + 1, $n);
                $this->swap($a, $i, $j); // backtrack
            }
        }
    }

    private function swap(&$a, $i, $j)
    {
        $temp = $a[$i];
        $a[$i] = $a[$j];
        $a[$j] = $temp;
    }
}
