<?php

namespace Database\Factories;

use App\Models\Auto;
use Illuminate\Database\Eloquent\Factories\Factory;

/**
 * @extends \Illuminate\Database\Eloquent\Factories\Factory<\App\Models\Order>
 */
class OrderFactory extends Factory
{
    /**
     * Define the model's default state.
     *
     * @return array<string, mixed>
     */
    public function definition(): array
    {
        $adresses = [
            "Київ, вул. Хрещатик, 1",
            "Львів, вул. Шевченка, 23",
            "Одеса, вул. Дерибасівська, 10",
            "Чернівці, вул. Героїв Майдану, 15",
            "Дніпро, пр. Дмитра Яворницького, 28",
            "Івано-Франківськ, вул. Незалежності, 24",
            "Харків, вул. Сумська, 45",
            "Запоріжжя, пр. Соборний, 12",
            "Полтава, вул. Пушкіна, 17",
            "Суми, вул. Горького, 8",
            "Київ, вул. Лесі Українки, 7",
            "Хмельницький, вул. Проскурівська, 14",
            "Львів, вул. Франка, 5",
            "Черкаси, бульв. Шевченка, 10",
            "Одеса, вул. Рішельєвська, 18",
            "Кривий Ріг, вул. Михайла Грушевського, 22",
            "Дніпро, вул. Леніна, 15",
            "Миколаїв, вул. Радянська, 3",
            "Харків, пр. Гагаріна, 21",
            "Житомир, вул. Михайлівська, 11",
            "Полтава, вул. Котляревського, 12",
            "Київ, вул. Володимирська, 10",
            "Львів, вул. Сахарова, 4",
            "Луцьк, вул. Карпенка-Карого, 16",
            "Одеса, вул. Артилерійська, 6",
            "Запоріжжя, вул. Таганрозька, 9",
            "Дніпро, вул. Космічна, 5",
            "Чернівці, вул. Гагаріна, 32",
            "Харків, вул. Московський проспект, 20",
            "Суми, вул. Миколи Лисенка, 21",
            "Полтава, вул. Степана Бандери, 8",
            "Івано-Франківськ, вул. Січових Стрільців, 30",
            "Львів, вул. Леонтовича, 3",
            "Миколаїв, вул. Миколи Лемешева, 9",
            "Одеса, вул. Балківська, 15",
            "Кривий Ріг, вул. Саксаганського, 11",
            "Дніпро, вул. Шевченка, 45",
            "Черкаси, вул. Пастернака, 8",
            "Харків, вул. Полтавський шлях, 12",
            "Київ, вул. Тараса Шевченка, 6",
            "Полтава, вул. Соборності, 22",
            "Житомир, вул. Лесі Українки, 19",
            "Львів, вул. Кирила і Мефодія, 4",
            "Луцьк, вул. Набережна, 6",
            "Одеса, вул. Пушкінська, 21",
            "Суми, вул. 1 Травня, 5",
            "Дніпро, вул. Петра Сагайдачного, 3",
            "Миколаїв, вул. Водопійна, 12",
            "Харків, вул. Дарвіна, 18",
            "Кривий Ріг, вул. Бульвар Шевченка, 9",
            "Полтава, вул. Котляревського, 8",
            "Київ, вул. Лесі Українки, 25",
            "Львів, вул. Січових Стрільців, 7",
            "Івано-Франківськ, вул. Степана Бандери, 17",
            "Одеса, вул. Ванцетті, 15",
            "Хмельницький, вул. Бандери, 14",
            "Дніпро, вул. Миколи Амосова, 21",
            "Кривий Ріг, вул. Київська, 10",
            "Харків, вул. Спортивна, 4",
            "Чернівці, вул. Шевченка, 20",
            "Полтава, вул. Чорновола, 19",
            "Миколаїв, вул. Горького, 11",
            "Львів, вул. Волошкова, 10",
            "Івано-Франківськ, вул. Гречка, 12",
            "Одеса, вул. Радісна, 4",
            "Черкаси, вул. Героїв Майдану, 18",
            "Дніпро, вул. Генерала Петрова, 3",
            "Запоріжжя, вул. Петра Могили, 16",
            "Харків, вул. Барабашова, 22",
            "Житомир, вул. Бернарда, 5",
            "Львів, вул. Шевченка, 21",
            "Київ, вул. Велика Васильківська, 33",
            "Одеса, вул. Середня, 8",
            "Харків, вул. Плеханівська, 15",
            "Дніпро, вул. Шевченка, 35",
            "Миколаїв, вул. Миколаївська, 6",
            "Полтава, вул. Шевченка, 23",
            "Кривий Ріг, вул. Петра Сагайдачного, 17",
            "Харків, вул. Одеська, 14",
            "Івано-Франківськ, вул. Грушевського, 5",
            "Львів, вул. Володимира Великого, 3",
            "Чернівці, вул. Лесі Українки, 19",
            "Одеса, вул. Ляпис, 14",
            "Хмельницький, вул. Грушевського, 8",
            "Дніпро, вул. Гоголя, 22",
            "Суми, вул. Київська, 27",
            "Полтава, вул. Карла Маркса, 10",
            "Запоріжжя, вул. Степана Бандери, 5",
            "Харків, вул. Чернишова, 19",
            "Житомир, вул. Михайлівська, 7",
            "Львів, вул. Жовківська, 13",
            "Черкаси, вул. Перемоги, 23",
            "Одеса, вул. Приморська, 5",
            "Миколаїв, вул. Космонавтів, 8",
            "Дніпро, вул. Театральна, 11",
            "Хмельницький, вул. Леніна, 3",
            "Полтава, вул. Горького, 14",
            "Київ, вул. Гетьмана, 13",
            "Харків, вул. 23 Серпня, 22",
            "Львів, вул. Університетська, 8",
            "Львів, вул. Лесі Українки, 5",
            "Черкаси, вул. Івана Франка, 12",
            "Одеса, вул. Черноморська, 6",
            "Запоріжжя, вул. Маяковського, 4",
            "Дніпро, пр. Маяковського, 16",
            "Кривий Ріг, вул. Промислова, 18",
            "Полтава, вул. Воскресенська, 22",
            "Чернівці, вул. Першотравнева, 4",
            "Харків, вул. Миколаївська, 3",
            "Київ, вул. Старонаводницька, 10",
            "Львів, вул. Грінченка, 4",
            "Дніпро, вул. Маяковського, 9",
            "Одеса, вул. Степова, 3",
            "Івано-Франківськ, вул. Довженка, 20",
            "Дніпро, вул. Князя Святослава, 12",
            "Запоріжжя, вул. Ворошилова, 13",
            "Полтава, вул. Мічуріна, 5",
            "Кривий Ріг, вул. Мала Садова, 2",
            "Харків, вул. Лермонтова, 2",
            "Черкаси, вул. Віктора Ющенка, 11",
        ];
        $faker = \Faker\Factory::create();
        $car_id = fake()->numberBetween(1, 15);
        $car = Auto::find($car_id);
        // $status=fake()->randomElement(['Створено','Скасовано','Призначено','Отримано','Аварійна ситуація','Доставлено']);
        $status = fake()->randomElement(['Створено', 'Скасовано']);
        if ($status != 'Створено') {
            return [
                'product' => $faker->word(),
                'weigth' => $faker->numberBetween(1000, 20000),
                'nomer' => null,
                'auto_type' => $car->type,
                'auto_id' => $car_id,
                'driver_id' => $car->driver_id,
                'supplier_id' => $faker->numberBetween(1, 15),
                'station_id' => $car->station_id,
                'status' => $status,
                'point_A' => $adresses[$faker->numberBetween(0, 119)],
                'point_B' => $adresses[$faker->numberBetween(0, 119)],
                'date_of_start' => $faker->dateTimeThisYear(),
            ];
        } else {
            return [
                'product' => $faker->word(),
                'weigth' => $faker->numberBetween(1000, 20000),
                'auto_type' => $faker->randomElement(['Цистерна', 'Рефрежиратор', 'Контейнер']),
                'nomer' => null,
                'auto_id' => null,
                'driver_id' => null,
                'supplier_id' => $faker->numberBetween(1, 15),
                'station_id' => null, //$car->station_id,
                'status' => $status,
                'point_A' => $adresses[$faker->numberBetween(1, 119)],
                'point_B' => $adresses[$faker->numberBetween(1, 119)],
                'date_of_start' => $faker->dateTimeThisYear(),
            ];
        }
    }
}
